DuncanC42/STM32_embedded_systems/nucleoF411_base/src/main.c
#include "stm32f4xx_hal_msp.h"
#include "stm32f4xx_hal_gpio.h"
#include "stm32f4xx_hal_tim.h"
#include "stm32f4xx_hal_uart.h"
#include "stm32f4xx_hal_i2c.h"
#include "leds.h"
#include "sw.h"
#include "lm75.h"
#include "stm32f4xx_hal.h"

TIM_HandleTypeDef htim3;
TIM_HandleTypeDef htim5;
UART_HandleTypeDef huart2;
I2C_HandleTypeDef hi2c1;

//===========================================================
void HAL_GPIO_EXTI_Callback(uint16_t GPIO_Pin)
{
	switch(GPIO_Pin)
	{
	}
}
//============================================================
void HAL_UART_RxCpltCallback(UART_HandleTypeDef *huart)
{
	if(huart == &huart2)
	{
	}
}
//============================================================
void HAL_TIM_PeriodElapsedCallback(TIM_HandleTypeDef *htim)
{

}
//============================================================
int main()
{
	HAL_Init();
	HAL_MspInit();
	static int state = 0;
	while(1)
		{


			switch(state)
			{
				case 0 :
					if ( sw_center_raw() == 1 ) {
						state = 1; // détermination de l'état suivant
					}
					red_led(0); green_led(0); blue_led(0); 		 // Sorties pour l'état 0;
					break;

				case 1 :
					if ( sw_down_raw() == 1 ) {
						state = 0;       // détermination de l'état suivant
					}
					red_led(1); green_led(1); blue_led(1);		 // Sorties pour l'état 1;
					break;

				default : break;
			}
		}
	return 0;
}
//============================================================

